NikolayBobovnikov/ircapture/auvir_embed/mocap/receiver/stm32f103/Src/main.c
//  ● Select the active input for TIMx_CCR2: write the CC2S bits to 10 in the TIMx_CCMR1  register (TI1 selected).
//  ● Select the active polarity for TI1FP2 (used for capture in TIMx_CCR2): write the CC2P bit to ‘1’ (active on falling edge).
    sConfigIC.ICFilter = 0;
    sConfigIC.ICPolarity = TIM_ICPOLARITY_FALLING;// TIM_ICPOLARITY_RISING? TODO
    sConfigIC.ICSelection = TIM_ICSELECTION_INDIRECTTI;
    HAL_TIM_IC_ConfigChannel(&htim4, &sConfigIC, TIM_CHANNEL_2);//TIM_CHANNEL_2? TODO
//  ● Select the valid trigger input: write the TS bits to 101 in the TIMx_SMCR register (TI1FP1 selected).
//  ● Configure the slave mode controller in reset mode: write the SMS bits to 100 in the TIMx_SMCR register.
    sSlaveConfig.InputTrigger = TIM_TS_TI1FP1;
    sSlaveConfig.SlaveMode = TIM_SLAVEMODE_RESET;
    HAL_TIM_SlaveConfigSynchronization(&htim4, &sSlaveConfig);
//  ● Enable the captures: write the CC1E and CC2E bits to ‘1’ in the TIMx_CCER register.


}

HAL_StatusTypeDef HAL_TIM_IC_PWM_Start_IT (TIM_HandleTypeDef *htim)
{
  /* Check the parameters */
  assert_param(IS_TIM_CCX_INSTANCE(htim->Instance, TIM_CHANNEL_1));
  assert_param(IS_TIM_CCX_INSTANCE(htim->Instance, TIM_CHANNEL_2));

  /* Enable the TIM Capture/Compare 1 interrupt */
  __HAL_TIM_ENABLE_IT(htim, TIM_IT_CC1);
  /* Enable the TIM Capture/Compare 2 interrupt */
  __HAL_TIM_ENABLE_IT(htim, TIM_IT_CC2);

  /* Enable the Input Capture channel */
  TIM_CCxChannelCmd(htim->Instance, TIM_CHANNEL_1, TIM_CCx_ENABLE);
  TIM_CCxChannelCmd(htim->Instance, TIM_CHANNEL_2, TIM_CCx_ENABLE);


  /* Enable the Peripheral */
  __HAL_TIM_ENABLE(htim);

  /* Return function status */
  return HAL_OK;
}
HAL_StatusTypeDef HAL_TIM_IC_PWM_Stop_IT (TIM_HandleTypeDef *htim)
{
    assert_param(IS_TIM_CCX_INSTANCE(htim->Instance, TIM_CHANNEL_1));
    assert_param(IS_TIM_CCX_INSTANCE(htim->Instance, TIM_CHANNEL_2));

    __HAL_TIM_DISABLE_IT(htim, TIM_IT_CC1);
    __HAL_TIM_DISABLE_IT(htim, TIM_IT_CC2);

    /* Disable the Input Capture channel */
    TIM_CCxChannelCmd(htim->Instance, TIM_CHANNEL_1, TIM_CCx_DISABLE);
    TIM_CCxChannelCmd(htim->Instance, TIM_CHANNEL_2, TIM_CCx_DISABLE);

    /* Disable the Peripheral */
    __HAL_TIM_DISABLE(htim);

    /* Return function status */
    return HAL_OK;
}

/** 
  * Enable DMA controller clock
  */
void MX_DMA_Init(void) 
{
  /* DMA controller clock enable */
  __HAL_RCC_DMA1_CLK_ENABLE();

  /* DMA interrupt init */
  HAL_NVIC_SetPriority(DMA1_Channel2_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel2_IRQn);
  HAL_NVIC_SetPriority(DMA1_Channel3_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel3_IRQn);

}

/** Configure pins as 
        * Analog 
        * Input 
        * Output
        * EVENT_OUT
        * EXTI
*/
void MX_GPIO_Init(void)
{

  GPIO_InitTypeDef GPIO_InitStruct;

  // GPIO Ports Clock Enable
  __GPIOD_CLK_ENABLE();
  __GPIOA_CLK_ENABLE();
  __GPIOB_CLK_ENABLE();

}

/* USER CODE BEGIN 4 */
void receive_handler()
{

    if(ind == 100)
    {
        int a  = 0;
    }


    /* Receive data frame
     * 1. start sequence
     * 2. data
     *  2.1 Coded angle
     *  2.2 Time of emission
     *  2.3 Beamer ID
     * 3. data redundancy (repeated, or use error correction code)
     * 4. stop sequence
     *
     * Check data integrity. If OK, data is received
     */

    /* 1. Waiting for start bit
     * 2. Input capture channel: rising edge detected. Start timer, wait 1/2 of period
     * 3. 1/2 period check: if signal is high, start bit is received, goto 4, otherwise stop timer, goto 1
     * 4. 1/2 + i period check: read timer signal, increment received bits count
     * 5. If rbc == total_bits, wait for stop bit
     * 6. Check stop bit: if signal is high, stop timer, save received data, update event (?), goto 1
     *
     */
    switch(ReceiverState)
    {
        case RX_WAITING_FOR_START_BIT:
        {
            // This should be on IC event
            if(is_rising_edge())
            {
                // wait for first point
                HAL_TIM_Base_Start_IT(&htim3);
                htim3.Instance->ARR = HalfPeriodOfStartStopBits;
                ReceiverState = RX_START_BIT_SENDING;
                StartStopSequenceReceiveState = STAGE_ON1;
                // wait for half a period of startstop bit sequence
                break;
            }
            // no necessity in reset_receiver_state here, because nothing to change
            break;
        }
        case RX_START_BIT_SENDING:
        {
            // Start sequence consists of signal sequence {1,0,1,0}, each bit of length PeriodOfStartStopBits
            switch(StartStopSequenceReceiveState)
            {
                //High confirmed: STAGE_0 -> STAGE_ON1 confirmation
                case STAGE_ON1:
                {
                    // This should be on update event
                    if(is_high_level_in_correct_time()) //high level is confirmed, continue reading start sequence
                    {
                        // first point. change timer period to the period between reading start/stop bit values
                        htim3.Instance->ARR = PeriodOfStartStopBits;
                        StartStopSequenceTransmitState = STAGE_ON1_OFF1;
                        break;
                    }
                    reset_receiver_state();
                    break;
                }
                //Low: STAGE_ON1 -> STAGE_OFF1 input capture
                case STAGE_ON1_OFF1:
                {
                    // falling edge should be detected
                    if(is_falling_edge_in_correct_time())
                    {
                        StartStopSequenceTransmitState = STAGE_OFF1;
                        break;
                    }
                    reset_receiver_state();
                    break;
                }
                //Low: STAGE_OFF1 confirmation
                case STAGE_OFF1:
                {
                    // This should be on update
                    if(is_low_level_in_correct_time())
                    {
                        StartStopSequenceReceiveState = STAGE_OFF1_ON2;
                        // wait for half a period of startstop bit sequence
                        break;
                    }
                    reset_receiver_state();
                    break;
                }
                //High: STAGE_OFF1 -> STAGE_ON2 input capture
                case STAGE_OFF1_ON2:
                {
                    // This should be on IC event (2nd bit - rising edge)
                    if(is_rising_edge_in_correct_time())
                    {
                        StartStopSequenceReceiveState = STAGE_ON2;
                        // wait for half a period of startstop bit sequence
                        break;
                    }
                    reset_receiver_state();
                    break;
                }
                //High: STAGE_ON2 confirmation
                case STAGE_ON2:
                {
                    // This should be on update
                    if(is_high_level_in_correct_time())
                    {
                        StartStopSequenceReceiveState = STAGE_ON2_OFF2;
                        // wait for half a period of startstop bit sequence
                        break;
                    }
                    reset_receiver_state();
                    break;
                }
                //Low: STAGE_ON2 -> STAGE_OFF2 input capture
                case STAGE_ON2_OFF2:
                {
                    // This should be on IC event (2nd bit - rising edge)
                    if(is_falling_edge_in_correct_time())
                    {
                        StartStopSequenceReceiveState = STAGE_OFF2;
                        // wait for half a period of startstop bit sequence
                        break;
                    }
                    reset_receiver_state();
                    break;
                }
                //Low: STAGE_OFF2 confirmation
                case STAGE_OFF2:
                {
                    if(is_low_level_in_correct_time())
                    {
                        // turn off input capture temporarily,
                        //wait for the beginning of data transmission
                        // HAL_TIM_IC_PWM_Stop_IT(&htim4); TODO
                        StartStopSequenceTransmitState = STAGE_0;
                        ReceiverState = RX_START_BIT_SENT;
                        break;
                    }
                    reset_receiver_state();
                    break;
                }
                default:
                {
                    reset_receiver_state();
                    break;
                }
            }
            break;
        }
        // Transitiolal state, adjust timer period so that we start readind data bits in the middle of each signal
        case RX_START_BIT_SENT:
        {
            if(is_timer_update())
            {
                // start reading data bits after the middle of the first pulse,
                // so wait for another HalfPeriodOfDataBits

                htim3.Instance->ARR = HalfPeriodOfDataBits;
                ReceiverState = RX_DATA_RECEIVING;
                // initialize buffer with all zeros
                rx_data = 0;
            }
            /// else - input capture, nothing to do
            break;
        }

        case RX_DATA_RECEIVING:
        {
            if(is_timer_update())
            {
                //now reading data bits with period of PeriodOfDataBits ticks
                // start reading values from the middle of the first bit
                if(0 == rx_current_bit_position)
                {
                    htim3.Instance->ARR = PeriodOfDataBits;
                }

                // send current bit of data
                if(rx_current_bit_position < rx_total_bits)  // change to next state
                {
                    // k-th bit of n: (n >> k) & 1
                    if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_SET)
                    {
                        // set bit at the inversed position
                        rx_data |= 1 << (rx_total_bits - rx_current_bit_position -1);
                    }
                    /*
                     * below is redundant since all rx_data bits are initialized to zeros
                    else
                    {
                        //rx_bit = 0;
                        rx_data |= 0 << rx_current_bit_position;
                    }
                    */
                    rx_current_bit_position++;
                }
                else
                {
                    rx_data;// received data is here
                    rx_current_bit_position = 0;
                    ReceiverState = RX_DATA_RECEIVED;
                    // wait remaining HalfPeriodOfDataBits before [the delay before] stop bit sequence
                    htim3.Instance->ARR = HalfPeriodOfDataBits;
                    HAL_TIM_Base_Start_IT(&htim3);
                }
            }// end of is_timer_update()
            /// else - input capture, nothing to do
            break;
        }
        case RX_DATA_RECEIVED:
        {
            if(is_timer_update())
            {
                // wait half of the delay before stop bit sequence
                //HAL_TIM_IC_PWM_Start_IT(&htim4); TODO
                htim3.Instance->ARR = HalfPeriodOfStartStopBits;
                TransmitterState = RX_STOP_BIT_RECEIVING;
                StartStopSequenceReceiveState = STAGE_OFF0;
                break;
            }
            /// else - input capture, nothing to do
            break;
        }
        case RX_STOP_BIT_RECEIVING:
        {
            switch (StartStopSequenceReceiveState)
            {
                //low: off confirmation
                case STAGE_OFF0:
                {
                    if(is_low_level_in_correct_time())
                    {
                        // continue reading stop bit sequence with PeriodOfStartStopBits interval
                        htim3.Instance->ARR = PeriodOfStartStopBits;
                        StartStopSequenceReceiveState = STAGE_ON1_OFF1;
                        break;
                    }
                    reset_receiver_state();
                    break;
                }
                //high: input capture
                case STAGE_OFF0_ON1:
                {
                    // rising edge input capture
                    if(is_rising_edge_in_correct_time())
                    {
                        StartStopSequenceTransmitState = STAGE_ON1;
                        break;
                    }
                    reset_receiver_state();
                    break;
                }
                //high confirmation
                case STAGE_ON1:
                {
                    if(is_high_level_in_correct_time())
                    {
                        StartStopSequenceReceiveState = STAGE_ON1_OFF1;
                        break;
                    }
                    reset_receiver_state();
                    break;
                }
                //low: STAGE_ON1 -> STAGE_OFF1
                case STAGE_ON1_OFF1:
                {
                    if(is_falling_edge_in_correct_time())
                    {
                        StartStopSequenceReceiveState = STAGE_OFF1;
                        break;
                    }
                    reset_receiver_state();
                    break;
                }
                // low: confirmation
                case STAGE_OFF1:
                {
                    if(is_low_level_in_correct_time())
                    {
                        StartStopSequenceReceiveState = STAGE_OFF1_ON2;
                        break;
                    }
                    reset_receiver_state();
                    break;
                }
                // high: STAGE_OFF1 -> STAGE_ON2
                case STAGE_OFF1_ON2:
                {
                    // rising edge input capture
                    if(is_rising_edge_in_correct_time())
                    {
                         StartStopSequenceReceiveState = STAGE_ON2;
                         break;
                    }
                    reset_receiver_state();
                    break;
                }
                // high confirmation
                case STAGE_ON2:
                {
                    // second pulse confrmation
                    if(is_high_level_in_correct_time())
                    {
                        StartStopSequenceReceiveState = STAGE_ON2_OFF2;
                        break;
                    }
                    reset_receiver_state();
                    break;
                }
                // low: STAGE_ON2 -> STAGE_OFFF2
                case STAGE_ON2_OFF2:
                {
                    if(is_rising_edge_in_correct_time())
                    {
                        ReceiverState = RX_STOP_BIT_RECEIVED;
                        StartStopSequenceReceiveState = STAGE_0;
                    }
                    reset_receiver_state();
                    break;
                }
                default:
                {
                    reset_receiver_state();
                    break;
                }
            }

            break;
        }
        case RX_STOP_BIT_RECEIVED:
        {
            // immediately after stop sequence, line should be low
            if(is_low_level_in_correct_time())
            {
                // we successfully received data, send corresponding event for listeners to read from the data buffer
                // TODO
                rx_data;
            }
            reset_receiver_state();
            break;
        }
        default:
        {
            reset_receiver_state();
            break;
        }
    } // switch(ReceiverState)
}
void reset_receiver_state()
{
    ReceiverState = RX_WAITING_FOR_START_BIT;
    StartStopSequenceReceiveState = STAGE_0;
    HAL_TIM_Base_Stop_IT(&htim3);
    rx_data = 0;
}

bool is_rising_edge_in_correct_time()
{
    if(__HAL_TIM_GET_FLAG(&htim4, TIM_FLAG_CC1) != RESET)
    {
        if(__HAL_TIM_GET_IT_SOURCE(&htim4, TIM_IT_CC1) != RESET)
        {
            if(abs(htim4.Instance->CCR1 - PeriodOfStartStopBits) <  max_delta_pwm)
            {
                return true;
            }
        }
    }
    return false;
}
bool is_falling_edge_in_correct_time()
{
    if(__HAL_TIM_GET_FLAG(&htim4, TIM_FLAG_CC2) != RESET)
    {
        if(__HAL_TIM_GET_IT_SOURCE(&htim4, TIM_IT_CC2) != RESET)
        {
            if(abs(htim4.Instance->CCR2 - HalfPeriodOfStartStopBits) <  max_delta_pwm)
            {
                return true;
            }
        }
    }
    return false;
}
bool is_high_level_in_correct_time()
{
    if(__HAL_TIM_GET_FLAG(&htim3, TIM_FLAG_UPDATE) != RESET)
    {
        if(__HAL_TIM_GET_IT_SOURCE(&htim3, TIM_IT_UPDATE) != RESET)
        {
            if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_SET)
            {
                return true;
            }
        }
    }
    return false;
}
bool is_low_level_in_correct_time()
{
    if(__HAL_TIM_GET_FLAG(&htim3, TIM_FLAG_UPDATE) != RESET)
    {
        if(__HAL_TIM_GET_IT_SOURCE(&htim3, TIM_IT_UPDATE) != RESET)
        {
            if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_RESET)
            {
                return true;
            }
        }
    }
    return false;
}
bool is_timer_update()
{
    if(__HAL_TIM_GET_FLAG(&htim3, TIM_FLAG_UPDATE) != RESET)
    {
        if(__HAL_TIM_GET_IT_SOURCE(&htim3, TIM_IT_UPDATE) != RESET)
        {
            return true;
        }
    }
    return false;
}
bool is_rising_edge()
{
    if(__HAL_TIM_GET_FLAG(&htim4, TIM_FLAG_CC1) != RESET)
    {
        if(__HAL_TIM_GET_IT_SOURCE(&htim4, TIM_IT_CC1) != RESET)
        {
            return true;
        }
    }
    return false;
}

void nop(){}

/* USER CODE END 4 */

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
